{
  "title": "My journey as a technical YouTuber",
  "content": "<div class=\"post hentry\">\n<a></a> <div class=\"post-body entry-content\" id=\"post-body-5391566653652898008\">\n<div class=\"separator\">\n<a href=\"https://4.bp.blogspot.com/-AKo2KG4CB38/XGDX0QPUlaI/AAAAAAAA5Qw/GtMtcPPxFfkwq96GrJ7FBmWz3tGn47tYwCLcBGAs/s1600/animal-balloons-birthday-1663412.jpg\"><img src=\"https://4.bp.blogspot.com/-AKo2KG4CB38/XGDX0QPUlaI/AAAAAAAA5Qw/GtMtcPPxFfkwq96GrJ7FBmWz3tGn47tYwCLcBGAs/s320/animal-balloons-birthday-1663412.jpg\" width=\"299\"></a></div>\n<br>\n<span>Sixty-five videos and one year later</span>\nOne year already that I start sharing videos on YouTube, I&apos;ve been blogging for many years and wanted to try something new. Creating videos seems like the next logical step. And this is how I decided to start sharing short videos to answer technical questions about Microsoft Azure on YouTube. This post, I will explain what I learned during the first year of my journey. I started my YouTube channel in French. During the two first months, I published one video by week. I learned a lot through this period, how to prepare my code snippets, my files, and my screen. The biggest takeaway was that: preparation is the key. The more prepared you are, the more efficient you will be in front of the camera. I also discover that compare to writing a blog post; you need to pay more attention, way earlier in the process, to the tiny details. It may sound like a clich&#xE9;, but it was challenging to watch myself. But it&apos;s the best way to improve. You need to accept those mistakes and promise yourself that next time, you will do better. It&apos;s normal and okay not to be perfect. One thing that I was looking forward was to be able to share my videos with all my clients/ friends/ community members. However, I couldn&apos;t because while some are perfectly comfortable in French (and only French), others only understand English. And this is why I decided to record all my videos in both French and English. I knew that would mean doubling the workload, so I adapted my schedule to publish every second week. Doing all does videos I found my beat, my style, the things I like and dislike. I also spend a lot of time learning the YouTube platform through books and by watching other YouTubers. It&apos;s such an incredible resourceful community! <a href=\"https://1.bp.blogspot.com/--B-SNCpUWqw/XGmu-hsl-JI/AAAAAAAA5rs/7vDY9c4wEEsfGW5XZxZ8l6Jw4aDhS246gCLcBGAs/s1600/IMG_20190109_130501.jpg\"><img src=\"https://1.bp.blogspot.com/--B-SNCpUWqw/XGmu-hsl-JI/AAAAAAAA5rs/7vDY9c4wEEsfGW5XZxZ8l6Jw4aDhS246gCLcBGAs/s320/IMG_20190109_130501.jpg\" width=\"240\"></a>The software (Camtasia from <a href=\"https://www.techsmith.com/video-editor.html\">TechSmith</a>)&#xA0; I was using, and that I&apos;m still using today, can record both your screen and your webcam. It keeps all the tracks separated, and this is great because you can change the size and position of the mortise in post-production. My challenge was that I wanted to record both in 1080P (full HD) because during my intros and conclusion when the webcam input fill the screen I want good image quality. However, the software (or more likely my PC), did not let me record in 1080P (full HD) the screen and the webcam input.\nTo upgrade the quality of my recordings, I decided to use my DSLR instead of my webcam. Of course, it represents more work in post-production because now I need to synchronize the two videos sources, but now everything is 1080. The more I was studying my statistics and reading comments (thank you all for your constructive comments by the way), I started to understand that having all my videos in French and English on the same channel was not the best idea. First, for the YouTube algorithm, it was very confusing because it couldn&apos;t identify the video&apos;s language. Therefore, it&apos;s harder to do its job and make recommendations. Secondly, it didn&apos;t cross my mind at the beginning, because I understand both languages, but for a subscriber that understand only one of the language, it&apos;s was very confusing and not very pleasing to have all those &quot;others&quot; un-useful videos in the feed.<div class=\"separator\">\n<a href=\"https://1.bp.blogspot.com/-w8hxzx9HO1c/XGmwsht3HHI/AAAAAAAA5r4/FcrfaDjlJ_4_oLE6SCN8H3jbDVjxF1QCwCLcBGAs/s1600/2019-02-17_14-05-49.png\"><img src=\"https://1.bp.blogspot.com/-w8hxzx9HO1c/XGmwsht3HHI/AAAAAAAA5r4/FcrfaDjlJ_4_oLE6SCN8H3jbDVjxF1QCwCLcBGAs/s400/2019-02-17_14-05-49.png\" width=\"400\"></a></div> After a very long (and hard) reflection, I decided to create a second channel and &quot;move&quot; all my French content to that channel. I say &quot;move&quot; but you cannot &quot;move&quot; contents on YouTube, and that was the principal reason why I was hesitating to split my channel. By creating a new channel, and re-uploading my older (aka French) videos I was losing all my stats (views, subscribers), and references. The effect was immediate on the English channel as the views and subscribers exploded a week after. And on the other side, my brand new French channel didn&apos;t really catch-up. Never the less I intend to continue to create French content. ;) As this post gets published, I have a cumulative total of sixty-five videos online and more than a thousand subscribers. I publish every second week, usually on Thursday, two videos on the same topic one in French on <a href=\"http://fr.cloud5mins.com/\">fr.cloud5mins.com</a> and one in English on <a href=\"http://cloud5mins.com/\">cloud5mins.com</a>. I have a fantastic community super supportive, asking questions and suggesting topics.\n<div class=\"separator\">\n<a href=\"https://1.bp.blogspot.com/-98nFkYhRvD0/XGDX0C-wCpI/AAAAAAAA5Qs/2jnr7w5bDGM6ws5M7FVWMfuvCqnUFWdYQCLcBGAs/s1600/2019-02-10_20-59-11.jpg\"><img src=\"https://1.bp.blogspot.com/-98nFkYhRvD0/XGDX0C-wCpI/AAAAAAAA5Qs/2jnr7w5bDGM6ws5M7FVWMfuvCqnUFWdYQCLcBGAs/s400/2019-02-10_20-59-11.jpg\" width=\"400\"></a></div>\n<a href=\"https://draft.blogger.com/$2019-02-10_20-59-11[5].jpg\"><br>\n</a> <br>\nI&apos;m very thankful for all that positive feedback. To help me you can subscribe to my YouTube channel of course, or become one of my Patreon at <a href=\"http://patreon.com/fboucheros\">patreon.com/fboucheros</a> I&apos;m definitely continuing to create videos. I plan to start doing some streaming on Twitch, where I will building cloud solutions. See you soon,\n<div class=\"separator\">\n<a href=\"https://1.bp.blogspot.com/--CtcSx3u7ko/XGDX0FL9UDI/AAAAAAAA5Qo/pO_HeDCIx0UbVywWq3gq43OMjFKoz8-1QCLcBGAs/s1600/2019-02-10_20-56-03.jpg\"><img src=\"https://1.bp.blogspot.com/--CtcSx3u7ko/XGDX0FL9UDI/AAAAAAAA5Qo/pO_HeDCIx0UbVywWq3gq43OMjFKoz8-1QCLcBGAs/s320/2019-02-10_20-56-03.jpg\" width=\"319\"></a></div> </div> </div>",
  "author": null,
  "date_published": null,
  "lead_image_url": "https://4.bp.blogspot.com/-AKo2KG4CB38/XGDX0QPUlaI/AAAAAAAA5Qw/GtMtcPPxFfkwq96GrJ7FBmWz3tGn47tYwCLcBGAs/w1200-h630-p-k-no-nu/animal-balloons-birthday-1663412.jpg",
  "dek": null,
  "next_page_url": null,
  "url": "http://www.frankysnotes.com/2019/02/sixty-five-videos-and-one-year-later.html",
  "domain": "www.frankysnotes.com",
  "excerpt": "Sixty-five videos and one year later One year already that I start sharing videos on YouTube, I've been blogging for many years and want...",
  "word_count": 785,
  "direction": "ltr",
  "total_pages": 1,
  "rendered_pages": 1
}